public class Main {
    public static void main(String[] args) {
        // Буду прописывать номера заданий для обеспечения читабельности кода (надеюсь это не будет ошибкой =))
        // Задание 1
        System.out.println("Задание 1");
        var dog = 8;
        var cat = 3.6;
        var paper = 763789;
        System.out.println(dog);
        System.out.println(cat);
        System.out.println(paper);
        // Задание 2
        System.out.println("Задание 2");
        dog = dog + 2;
        cat = cat + 2;
        paper = paper + 2;
        System.out.println(dog);
        System.out.println(cat);
        System.out.println(paper);
        // Задание 3
        System.out.println("Задание 3");
        double dog1 = dog - 3.5;
        cat = cat - 1.6;
        paper = paper - 7639;
        System.out.println(dog1);
        System.out.println(cat);
        System.out.println(paper);
        // Задание 4
        System.out.println("Задание 4");
        var friend = 19;
        System.out.println(friend);
        friend = friend * 2;
        System.out.println(friend);
        friend = friend / 7;
        System.out.println(friend);
        // Задание 5
        System.out.println("Задание 5");
        var frog = 3.5;
        System.out.println(frog);
        frog = frog * 10;
        System.out.println(frog);
        frog = frog / 3.5;
        System.out.println(frog);
        frog = frog + 4;
        System.out.println(frog);
        // Задание 6
        System.out.println("Задание 6");
        var boxer1 = 78.2;
        var boxer2 = 82.7;
        var boxerSum = boxer2 + boxer1;
        var boxerDifference = boxer2 - boxer1;
        System.out.println("Общая масса двух бойцов " + boxerSum);
        System.out.println("Разница между массами бойцов " + boxerDifference);
        // Задание 7
        System.out.println("Задание 7");
        var boxerDifferenceNew = boxer2 - boxer1;
        var boxerDifferenceNew1 = boxer2 % boxer1;
        System.out.println("Разница между массами бойцов " + boxerDifferenceNew);
        System.out.println("Разница между массами бойцов " + boxerDifferenceNew1);
        // Задание 8
        System.out.println("Задание 8");
        var hour = 640;
        var humanHour = 8;
        var human = hour / humanHour;
        System.out.println("Всего работников в компании — " + human + " человек");
        var humanAdded = 94 + human;
        var humanHourNew = humanAdded * humanHour;
        System.out.println("Если в компании работает " + humanAdded + " человек, то всего " + humanHourNew +
                " часов работы может быть поделено между сотрудниками");}


    }
